---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyMultidayDatetimeText
source: html/10a3ad3f-fa91-20ce-608a-ad9bc6e8d4d8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyMultidayDatetimeText Property

"Multi-day date and time text"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudyMultidayDatetimeText { get; }
```